In [1]:
import pandas as pd
import numpy as np

In [5]:
mrbean = pd.read_csv('mrbean_facebook_statuses_join.csv', usecols = ['status_message_mrbean','status_type','num_likes'])
nasa = pd.read_csv('nasa_facebook_statuses_join.csv', usecols = ['status_message_nasa','status_type','num_likes'])

In [6]:
nasa.head()

                                 status_message_nasa status_type  num_likes
0  This morning, the #RockOn mission with student...       photo       5142
1  Pluto's largest moon, Charon, is home to an un...       photo      19074
2  Our Restore-L mission is an endeavor to launch...       photo       7551
3  A new dark vortex was discovered in the atmosp...       photo      24359
4                                                NaN       video       2731

In [8]:
fb = pd.concat([mrbean, nasa])

In [9]:
fb.head()

,status_message_mrbean,status_type,num_likes,status_message_nasa
0,It's time for Mr Bean and Teddy to get ready f...,video,16079,NaN
1,NaN,photo,114008,NaN
2,NaN,photo,218579,NaN
3,Mr Bean is ready to do some shopping but bewar...,video,20338,NaN
4,NaN,photo,215591,NaN